{
  "language": "Language",
  "nav-skills": "Skills",
  "nav-blog": "BLOG",
  "nav-projects": "Projects",
  "nav-experiences": "Experiences",
  "nav-about": "About",
  "nav-contact": "Contact",
  "programming-languages": "Programming Languages",
  "languages": "Languages",
  "skills-english": "English",
  "skills-french": "French",
  "game-development": "Game Development",
  "operating-systems": "Operating Systems",
  "projects-platformer": "A platfomer game made with Unity. Goal is to pass each challenge that is presented until you reach the end.",
  "projects-kingdom-panic": "A game made with Unreal Engine. It's a tower defense where the goal is to place towers as to defend against the enemy.",
  "projects-pacman": "An attempt of the game Pacman using javascript.",
  "projects-groupie-tracker": "Use of the groupie-tracker API to create an app with golang.",
  "watch-on-youtube": "Watch on YouTube",
  "github-repository": "GitHub Repository",
  "projects-message": "If you want to see all my projects, check out my",

  "looking-for": "Looking for",
  "looking-for-message": "I am looking for an internship in development. I mainly do backend work, but as a developer, it is my job to adapt to frontend work if needed.",
  "more-details": "Here are more details :",
  "contract": "Contract Type → 1 or 3-year apprenticeship contract",
  "schedule": "Schedule → 2 weeks in the company, 1 week in training",
  "specialization": "Specialization B3 (next year) → Development",

  "my-journey": "My journey",
  "my-journey-message": " Passionate by games and computers since childhood, I embarked on a journey into the IT world and am now working as a developer.I'm still in the process of specializing, so my current projects mainly involve school assignements and interships. My experience includes working with Unreal Engine (Blueprints), C# (APIs and Unity), Python (for a Discord bot and data analysis with Pandas), PHP (e-commerce site and a forum) and Javascript (for a Pac-Man game), among others. I have completed my BTS SIO diploma and am now in the process of my master's degree.",

  "experience-1-name": "E-commerce",
  "experience-1-title": "Learning project",
  "experience-1-duration": "15 January 2024 - 16 February 2024",
  "experience-1-description": "Creation of an e-commerce site where users can sell products.",
  "experience-1-design-item-1": "Design of the authentication system",
  "experience-1-design-item-2": "Design of user functionalities",
  "experience-1-design-item-3": "Design of the database",
  "experience-1-design-item-4": "Design of the MVC architecture",
  "experience-1-methodology-description": "Every week, we hold a project progress meeting with the team. We use Trello for organization and Discord for communication.",

  "experience-2-name": "API",
  "experience-2-title": "Learning project",
  "experience-2-duration": "21 November 2023 - 14 January 2024",
  "experience-2-description": "Creation of an API to manage CRUD operations for users and their products",
  "experience-2-design-item-1": "Controller design",
  "experience-2-design-item-2": "Service design",
  "experience-2-design-item-3": "Model design",
  "experience-2-design-item-4": "Data Access design",
  "experience-2-design-item-5": "Database design",
  "experience-2-methodology-description": "Every week, we hold a project progress meeting with the team. We use Trello for organization and Discord for communication.",

  "experience-3-name": "Tower Defense",
  "experience-3-title": "Learning project",
  "experience-3-duration": "October 2022 - May 2023",
  "experience-3-description": "Creation of a Tower Defense game in Unreal Engine using blueprints. The objective is to protect the castle by placing towers to defeat enemies.",
  "experience-3-design-item-1": "Tower Firing Mechannics design",
  "experience-3-design-item-2": "Tower Placement System design",
  "experience-3-design-item-3": "Enemy Wave design",
  "experience-3-design-item-4": "Tower Upgrade design",
  "experience-3-methodology-description": "Project updates every two weeks with the team, tracking progress via Discord. Additionally, maintaining a list of completed and pending tasks for better organization.",

  "experience-4-name": "CO2 Interface",
  "experience-4-title": "Internship",
  "experience-4-duration": "24 June 2024 - 9 August 2024",
  "experience-4-description": "Creation of a web interface for a company called Consort Group. The goal is to have a functional interface to assist with CO2 calculations.",
  "experience-4-design-item-1": "Design of the technological infrastructure",
  "experience-4-design-item-2": "Design of the interface with Figma",
  "experience-4-methodology-description": "Project review twice a week (Wednesday and Friday) with the team.",

  "experience-duration": "Duration",
  "experience-methodology": "Methodology",
  "experience-design": "Design",

  "contact-phone": "Phone: ",
  "download-cv": "Download CV",

  "contact-right-phone-number": "Phone Number",
  "contact-left-name": "Name:",
  "contact-left-button-text": "Submit",

  "blog-1-description": "My experience and things that I have worked on in my internship at Consort Group.",
  "blog-view-details": "View details...",
  "modal-details": "Details",
  "modal-close": "Close",
  "modal-read": "Read",
  "inner-modal-go-back": "Go back",

  "introduction-item-1": "Consort Group is a French company that specializes in IT infrastructure and data management solutions. It offers services across multiple domains including cybersecurity, cloud computing or systems management.",
  "introduction-item-2": "The group is operating under two main branches: Consortis, which focuses on IT infrastructure services, and Consortia, which specializes in data engineering and digital development.",
  "introduction-item-3": "The time that I have spent there can be divided into 2 parts. For the first 2 weeks, I have worked with Power BI and for the remaining 5 weeks, I have developed an interface to automate a specific part of the CO2 footprint calculation process.",
  "introduction-item-4": "This specific part was importing the files used to calculate CO2. In addition, I also developed a component for displaying the results of this said CO2 footprint.",

  "powerbi-section-title-1": "What is it ?",
  "powerbi-section-title-2": "What is the goal ?",
  "powerbi-section-title-3": "What does it look like ?",

  "powerbi-item-1": "Power BI is a business analytics tool developed by Microsoft thatt allows you to visualize data. It helps you create interactive and visually appealing dashboard and reports from your data. It can also connect various data sources, such as Excel spreadsheets, databases, and more.",
  "powerbi-item-2": "The goal is to verify that the numbers that came out of the calculation engine was indeed correct and corresponded with the data that was within Power BI. Even though this part didn't really get much use, it was still helpful to verify this and make sure that the numbers are correct.",
  "powerbi-item-3": "Here's some images on how the power bi presentation that I have done during the first 2 weeks.",
  "powerbi-item-4": " On the left we have all the filters where we can choose what we would like the data to be based on. If we were to choose a client like CLIENT XYZ, then all the data inside the graphs will be completely based on this particular client and no other client. If we were to choose a profile next, the graphs would have been based on the CLIENT XYZ as well as the chosen profile.",
  "powerbi-item-5": "In the top right we can see that we have the months of the year. Clicking on a month will display the data on that particular month while the donut chart shows the data during the full year.",
  "powerbi-item-6": "Here's an image of the third tab:",
  "powerbi-item-7": "Here we can see that we have the same thing effectively but only based on the profile.",

  "co2interface-section-title-1": "Results page",
  "co2interface-section-title-2": "Index page",
  "co2interface-section-title-3": "Documenting code",

  "co2interface-item-1": "This is what I've done during the 5 remaining weeks after working with Power BI.",
  "co2interface-item-2": "Before starting the project, we first must identify the technical stack, meaning the technologies that we're going to use for this particular project. Here's how it looks like:",
  "co2interface-item-3": "Preferred IDE",
  "co2interface-item-4": "Chosen language for data manipulation",
  "co2interface-item-5": "Testing environment for Pandas",
  "co2interface-item-6": "Used for manipulation Excel files data",
  "co2interface-item-7": "Chosen language for charts and interacting with the backend",
  "co2interface-item-8": "Used to make charts",
  "co2interface-item-9": "Everything besides the charts has been done using CSS and most importantly, Bootstrap. The charts has been done using the library Chart.js. As you might seen in the images, the numbers are completely arbitatry since I didn't have any Excel files with real data.",
  "co2interface-item-10": "I call this part 'index' to reference the index.html or index.php which is the entry point to a website. In my case, this part of the interface is the entry point where you would import all necessary files.",
  "co2interface-item-11": "So the index page looks like this. We have two options, either generating a list of collaborators or calculate the CO2 footprint. Let's talk first about the list of collaborators.",
  "co2interface-item-12": "So first we choose the year since we're going to calculate the CO2 footprint based on an year. After choosing the year, we have multiple options. We can either just generate the list by clicking on the download button that will create an Excel file with the collaborators. In addition, the user can generate a list of collaborators by filtering them beforehand. There's also a button that resets those said filters.",
  "co2interface-item-13": "Furthermore, there's a reason why the filters and the buttons look a little greyed out, it's to show that you cannot choose them before you choose the year.",
  "co2interface-item-14": "Here we have the second part:",
  "co2interface-item-15": "It's the same concept, you choose the year but this time you drag and drop (or click on the button) to manually insert the needed file. This is the only file that is needed to insert manually everytime.",
  "co2interface-item-16": "There's around 7 to 9 necessary files for the calculation of the CO2 footprint which need to be verified beforehand. However, this part is yet to be finished since I didn't have the time to do so during my internship. As you might see, there's also no button to click to start the calculation process either.",
  "co2interface-item-17": "Documenting your code is important not only for other people so that they know what your code does, but also for yourself. Since I don't have access to the code at the moment of writing, I can only provide an example on how I have documented my code (docstring).",
  "co2interface-item-18": "Right above I'm showing an example on how I have documented my bode for Javascript and Python. These are just examples and if you search images on Google you'll find that people will write their docstring in different ways but those images represent pretty closely how I have documented my code.",
  "co2interface-item-19": "A docstring consists firstly of writing a general phrase on what your code does followed by your arguments. Each argument that your function has must be written by their name and their type as well as what they represent inside the function. You can then write what the function returns as well as what it might throw as an error. Finally, you could also provide an example on how you would call the function and what it might return based on the values that you have given it.",

  "conclusion-item-1": "Firstly, I would like to talk about what I have learned / got better at, so here are a few of those things. First thing that I worked on was Power BI. I think it's a great and useful tool that can help a lot with analyzing data. Another thing was Python. It has been some time since I have worked with Python and I think it was great to code again in this language. It was also nice that I have discovered a things like Flask where you can host your own server. THe library Pandas was something that I actually was pretty bad in school so actually working with it again made it more clear on what does it do and how does it actually work. I have also worked on UX UI design since I had to design the CO2 interface all by myself (I used Figma to design it).",
  "conclusion-item-2": "Even though I prefer backend work, I still had to work with some frontend languages like javascript. I primarily worked with the library Chart.js that helped me design a few charts for the results page for the CO2 interface. Another thing that I learned is to properly document my code. I was commenting my code before, don't get me wrong, but I didn't document it how you should've. What I mean by this is writing a docstring where you write a simple phrase about how the function does in which you can further explain the process of the function in detail. You also need to specify the parameters and their types as well as what they represent. Can't forget about what the function returns as well if it throws any kind of error. Lastly, you can also include an example on how you would use this function.",
  "conclusion-item-3": "Finally, I would like to talk more about the professional world. I think this internship was nice to see more of what the professional world looks like and how does it function a little bit. From working with different colleagues, to reunions, I think it has helped me understand all of it a tiny bit better. Something that I have seen before but not in greater detail was the world of corruption or how to properly defend yourself from potential IT threats. I have done a few courses from something called the SeriousGames where I have learneed a litle about  those things. Here are the certificates:"
}
