{
    "language": "Language",
    "skills": "Skills",
    "projects": "Projects",
    "experiences": "Experiences",
    "contact": "Contact",
    "about-me": "About me",
    "about-me-message": "Currently in my second year (BAC+2) of computer science, my goal is to strengthen my skills in this field. Starting from next year, I will focus on game development.",
    "looking-for": "Looking for",
    "looking-for-message": "I am looking for an internship in development, preferably in the video game industry, but I am open to other opportunities, with a duration of either 6 weeks or 12 weeks (part-time). Ideally, I would be available to start the internship towards the end of the school year, around May 20th.",
    "programming-languages": "Programming Languages",
    "languages": "Languages",
    "skills-english": "English",
    "skills-french": "French",
    "game-development": "Game Development",
    "operating-systems": "Operating Systems",
    "projects-platformer": "A platfomer game made with Unity. Goal is to pass each challenge that is presented until you reach the end.",
    "projects-kingdom-panic": "A game made with Unreal Engine. It's a tower defense where the goal is to place towers as to defend against the enemy.",
    "projects-pacman": "An attempt of the game Pacman using javascript.",
    "projects-groupie-tracker": "Use of the groupie-tracker API to create an app with golang.",
    "watch-on-youtube": "Watch on YouTube",
    "github-repository": "GitHub Repository",
    "projects-message": "If you want to see all my projects, check out my",
    "experience-1-name": "Educational Project - YDAYS",
    "experience-2-name": "Internship at LesBaleries' Association",
    "experience-1-title": "Tower Defense Game in Unreal Engine",
    "experience-2-title": "Website Development with WordPress",
    "experience-1-content": "I actively contributed to the development of a Tower Defense game using Blueprints. The project spanned seven months, involving regular bi-weekly team meetings to ensure project alignment. My role included effective remote project management, fostering optimal progress throughout the development process.",
    "experience-2-content": "During my internship with LesBaleries' association, I collaborated within a team to develop a WordPress website. Over the course of six weeks, I worked remotely, utilizing SQL for database management and executing necessary queries. Additionally, I adapted the code to accommodate various extensions used in the project.",
    "experience-1-duration": "October 2022 - May 2023",
    "experience-2-duration": "April 2022 - May 2022",
    "experience-duration": "Duration:",
    "experience-in-person": "In-Person",
    "experience-remote": "Remote",
    "contact-note": "To note, the contact form will not send any message to my actual email address.",
    "contact-phone": "Phone:",
    "call": "Call",
    "name": "Your Name",
    "email": "Your Email",
    "subject": "Subject",
    "form-submit": "Send Message",
    "useful-links": "Useful Links"
}