{
    "language": "Langue",
    "navbar-skills": "Compétences",
    "navbar-projects": "Projets",
    "navbar-experiences": "Expériences",
    "navbar-contact": "Contacter",
    "about-me": "À propos de moi",
    "about-me-message": "Actuellement en deuxième année (BAC+2) d'informatique, mon objectif est de renforcer mes compétences dans ce domaine. À partir de l'année prochaine, je me concentrerai sur le développement de jeux.",
    "looking-for": "Recherche",
    "looking-for-message": "Je suis à la recherche d'un stage en développement, de préférence dans l'industrie du jeu vidéo, mais je suis ouvert à d'autres opportunités, d'une durée de 6 ou 12 semaines (à temps partiel). Idéalement, je serais disponible pour commencer le stage vers la fin de l'année scolaire, vers le 20 mai.",
    "programming-languages": "Langages de Programmation",
    "languages": "Langues",
    "skills-english": "Anglais",
    "skills-french": "Français",
    "game-development": "Développement de Jeux",
    "operating-systems": "Systèmes d'Exploitation",
    "projects-platformer": "Un jeu de plateforme réalisé avec Unity. Le but est de passer chaque défi présenté jusqu'à ce que vous atteigniez la fin.",
    "projects-kingdom-panic": "Un jeu réalisé avec Unreal Engine. C'est une défense de tour où le but est de placer des tours pour se défendre contre l'ennemi.",
    "projects-pacman": "Une tentative du jeu Pacman en utilisant JavaScript.",
    "projects-groupie-tracker": "Utilisation de l'API groupie-tracker pour créer une application avec GoLang.",
    "watch-on-youtube": "Regarder sur YouTube",
    "github-repository": "Dépôt GitHub",
    "projects-message": "Si vous souhaitez voir tous mes projets, consultez mon",
    "experience-1-name": "Projet Éducatif - YDAYS",
    "experience-2-name": "Stage à l'association LesBaleries",
    "experience-1-title": "Jeu de Défense de Tour avec Unreal Engine",
    "experience-2-title": "Développement de Site Web avec WordPress",
    "experience-1-content": "J'ai activement contribué au développement d'un jeu de défense de tour en utilisant Blueprints. Le projet a duré sept mois, impliquant des réunions d'équipe régulières toutes les deux semaines pour assurer l'alignement du projet. Mon rôle comprenait une gestion de projet à distance efficace, favorisant un progrès optimal tout au long du processus de développement.",
    "experience-2-content": "Pendant mon stage à l'association LesBaleries, j'ai collaboré au sein d'une équipe pour développer un site Web WordPress. Sur une période de six semaines, j'ai travaillé à distance, utilisant SQL pour la gestion de la base de données et exécutant les requêtes nécessaires. De plus, j'ai adapté le code pour accommoder diverses extensions utilisées dans le projet.",
    "experience-1-duration": "Octobre 2022 - Mai 2023",
    "experience-2-duration": "Avril 2022 - Mai 2022",
    "experience-duration": "Durée:",
    "experience-in-person": "En Personne",
    "experience-remote": "À Distance",
    "contact-note": "À noter, le formulaire de contact n'enverra aucun message à mon adresse e-mail réelle.",
    "contact-phone": "Téléphone:",
    "call": "Appeler",
    "name": "Votre Nom",
    "email": "Votre Email",
    "subject": "Sujet",
    "form-submit": "Envoyer Message",
    "useful-links": "Liens Utiles"
}
